In [1]:
import numpy as np
import csv
from sklearn.cross_validation import cross_val_score
from sklearn.linear_model import LogisticRegression
from sklearn.externals import joblib
from sklearn.metrics import roc_curve, auc
from sklearn.cross_validation import train_test_split
from sklearn.cross_validation import StratifiedKFold
from scipy import interp
from  matplotlib import pyplot as plt
from sklearn import cross_validation
import pandas as pd
from sklearn.metrics import roc_auc_score
from sklearn import metrics, preprocessing
import pickle
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [52]:
df= pd.read_csv('test.csv')

In [53]:
df.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [54]:
##drop passengerID and Name as these will not be much help in classification
data= df.drop( ["PassengerId", 'Name','Ticket','Cabin'],axis=1)

In [55]:
## fill na values with the column mean
data = data.fillna(data.mean())
# data = data.dropna()

In [56]:
data = data.fillna(data.mode)

In [57]:
data.describe()

           Pclass         Age       SibSp       Parch        Fare
count  418.000000  418.000000  418.000000  418.000000  418.000000
mean     2.265550   30.272590    0.447368    0.392344   35.627188
std      0.841838   12.634534    0.896760    0.981429   55.840500
min      1.000000    0.170000    0.000000    0.000000    0.000000
25%      1.000000   23.000000    0.000000    0.000000    7.895800
50%      3.000000   30.272590    0.000000    0.000000   14.454200
75%      3.000000   35.750000    1.000000    0.000000   31.500000
max      3.000000   76.000000    8.000000    9.000000  512.329200

In [58]:
## one hot encode all of the categorical values Pclass, Embarked, Sex
## code example for one hot encoding : http://corpocrat.com/2014/08/29/tutorial-titanic-dataset-machine-learning-for-kaggle/
dummy_values = []
cols = ['Pclass','Sex','Embarked']
for col in cols:
    dummy_values.append(pd.get_dummies(data[col]))

In [59]:
one_hot_values = pd.concat(dummy_values, axis=1)

In [60]:
data = pd.concat((data,one_hot_values),axis=1)

In [61]:
data.head(5)

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,1,2,3,female,male,C,Q,S
0,3,male,34.5,0,0,7.8292,Q,0,0,1,0,1,0,1,0
1,3,female,47.0,1,0,7.0000,S,0,0,1,1,0,0,0,1
2,2,male,62.0,0,0,9.6875,Q,0,1,0,0,1,0,1,0
3,3,male,27.0,0,0,8.6625,S,0,0,1,0,1,0,0,1
4,3,female,22.0,1,1,12.2875,S,0,0,1,1,0,0,0,1

In [62]:
## drop the non-one-hot encoded values 
# data = data.drop( ['Sex', 'Embarked'],axis=1)
data = data.drop( ['Sex', 'Embarked', 'Pclass'],axis=1)

In [63]:
data.head(5)

    Age  SibSp  Parch     Fare  1  2  3  female  male  C  Q  S
0  34.5      0      0   7.8292  0  0  1       0     1  0  1  0
1  47.0      1      0   7.0000  0  0  1       1     0  0  0  1
2  62.0      0      0   9.6875  0  1  0       0     1  0  1  0
3  27.0      0      0   8.6625  0  0  1       0     1  0  0  1
4  22.0      1      1  12.2875  0  0  1       1     0  0  0  1

In [64]:
data.describe()

,Age,SibSp,Parch,Fare,1,2,3,female,male,C,Q,S
count,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000
mean,30.272590,0.447368,0.392344,35.627188,0.255981,0.222488,0.521531,0.363636,0.636364,0.244019,0.110048,0.645933
std,12.634534,0.896760,0.981429,55.840500,0.436934,0.416416,0.500135,0.481622,0.481622,0.430019,0.313324,0.478803
min,0.170000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,23.000000,0.000000,0.000000,7.895800,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,30.272590,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000,0.000000,1.000000,0.000000,0.000000,1.000000
75%,35.750000,1.000000,0.000000,31.500000,1.000000,0.000000,1.000000,1.000000,1.000000,0.000000,0.000000,1.000000
max,76.000000,8.000000,9.000000,512.329200,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [65]:
X =data.as_matrix()

In [66]:
print ("X shape is: ", X.shape)

X shape is:  (418, 12)

In [67]:
##make sure there are no nan values
np.any(np.isnan(X))

False

In [68]:
## from Mike's code along http://nbviewer.jupyter.org/gist/gcr/48a6593835044e92c780fc1922df0492
pre = preprocessing.StandardScaler()
pre.fit(X)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [48]:
pre.transform(X)

array([[-1.72791209,  0.3349926 , -0.49947002, ..., -0.56814154,
         2.84375747, -1.35067551],
       [-1.71962474,  1.32553003,  0.61699237, ..., -0.56814154,
        -0.35164743,  0.74037028],
       [-1.71133739,  2.51417495, -0.49947002, ..., -0.56814154,
         2.84375747, -1.35067551],
       ...,
       [ 1.71133739,  0.65196458, -0.49947002, ..., -0.56814154,
        -0.35164743,  0.74037028],
       [ 1.71962474,  0.        , -0.49947002, ..., -0.56814154,
        -0.35164743,  0.74037028],
       [ 1.72791209,  0.        ,  0.61699237, ...,  1.76012477,
        -0.35164743, -1.35067551]])

In [69]:
## Load model
clf2_full = joblib.load('log_reg_full.pkl')

In [70]:
preds = clf2_full.predict(X)

In [82]:
left = pd.DataFrame(df['PassengerId'])

In [78]:
right = pd.DataFrame({"Predictions": preds})

In [83]:
left.head(5)

   PassengerId
0          892
1          893
2          894
3          895
4          896

In [86]:
results = left.join(right)

In [88]:
results.head(5)

   PassengerId  Predictions
0          892            0
1          893            0
2          894            0
3          895            0
4          896            1

In [51]:
numpy.savetxt("predictions.csv", preds, delimiter=",")

In [90]:
results.to_csv("predictions.csv")